{"format": "graph-model", "generatedBy": "2.21.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "23"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "23"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "23"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "63"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Relu", "op": "_FusedMatMul", "input": ["inputs", "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "63"}]}, {"dim": [{"size": "63"}, {"size": "128"}]}]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_15_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "64"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_16_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_17_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "23"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_5_1/dense_17_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/dense_17_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2474}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/Cast/ReadVariableOp", "shape": [63, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_15_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_16_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/Cast/ReadVariableOp", "shape": [64, 23], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_17_1/BiasAdd/ReadVariableOp", "shape": [23], "dtype": "float32"}]}]}